# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Utilities
cask "tiles"
cask "firefox"
cask "google-chrome"
cask "grammarly"
cask "iterm2"
cask "slack"
cask "telegram"
cask "whatsapp"
cask "transmission"
cask "spotify"
cask "flycut"
brew "jq"
brew "nmap"
brew "openssl"
brew "watch"
cask "docker"
brew "docker-compose"

brew "zsh"
brew "zsh-completions"

# Dev
cask "postman"
brew "git"
brew "nvm"
brew "node"
brew "tmux"
brew "vim"
brew "zlib"
cask "sublime-text"
cask "macdown"
cask "sequel-pro"
casl "visual-studio-code"

# Util
cask "appcleaner"
cask "coconutbattery"
cask "the-unarchiver"
cask "cheatsheet"

# System
brew "mas"

# Network
brew "htop"
brew "nmap"
brew "mtr"
brew "wget"

# Communication
cask "slack"
cask "skype"

# App
mas "XCode", id: 497799835
