# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Utilities
cask "tiles"
#cask "firefox"
cask "gimp"
cask "google-chrome"
#cask "grammarly"
cask "iterm2"
cask "slack"
#cask "telegram"
#cask "whatsapp"
#cask "transmission"
cask "spotify"
cask "flycut"
brew "jq"
cask "raycast"
casl "signal"
cask "zoom"
cask "vlc"

# Internet security companies can use Nmap to scan a system and understand what weaknesses exist that a hacker could potentially exploit
# https://www.holmsecurity.com/blog/what-is-nmap#:~:text=Internet%20security%20companies%20can%20use,open%20ports%20and%20other%20weaknesses.
brew "nmap"
brew "openssl"
brew "watch"
cask "docker"
brew "docker-compose"

brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"


# Dev
cask "postman"
brew "git"
brew "nvm"
brew "node"
# brew "tmux"
brew "vim"
brew "zlib"
cask "sublime-text"
cask "macdown"
cask "sequel-ace"
cask "visual-studio-code"
cask "logseq"

# Util
cask "appcleaner"
cask "coconutbattery"
cask "the-unarchiver"
cask "cheatsheet"

# System
brew "mas"

# Network
brew "htop"
brew "nmap"
brew "mtr"
brew "wget"

# Communication
cask "slack"
cask "skype"

# App
mas "XCode", id: 497799835
